tutorials4NF/unsteadyStateForcedConvection4NF/abdominalAorticAneurysmDrugDelivery/constant/polyMesh/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 0.0085;

vertices
(
    (0 0 0)//0
    (0.9990482353	0.0436188235	0)//1
    (0.9990482353	0.0436188235	15.2941176471)//2

    (0 0 15.294117647)//3
    (0.9990482353	-0.0436188235	0)//4
    (0.9990482353	-0.0436188235	15.2941176471)//5

    (0 0 24.7058823529)//6
    (0.9990482353	0.0436188235	24.7058823529)//7
    (0.9990482353	-0.0436188235	24.7058823529)//8


    (0 0 40)//9
    (0.9990482353	0.0436188235	40)//10
    (0.9990482353	-0.0436188235	40)//11


);

blocks
(
    hex (0 4 1 0 3 5 2 3) (73 1 259) simpleGrading (0.1 1 1)
    hex (3 5 2 3 6 8 7 6 ) (73 1 162) simpleGrading (0.1 1 1)    
    hex (6 8 7 6 9 11 10 9) (73 1 259) simpleGrading (0.1 1 1)
);

edges
(

	spline 2 7
        (
               (0.9990482353	0.0436188235	15.2941176471)
//(0.9990482353	0.0436188235	15.2941176471)
(0.9990938933	0.0436213815	15.5294117647)
(0.9991754139	0.0436249407	15.7647058824)
(0.9993833649	0.0436340201	16)
(0.9998837406	0.0436558669	16.2352941176)
(1.0010190015	0.0437054335	16.4705882353)
(1.003446431	0.0438114174	16.7058823529)
(1.0083350989	0.0440248612	16.9411764706)
(1.0176014512	0.0444294389	17.1764705882)
(1.0341173804	0.0451505399	17.4117647059)
(1.0617654984	0.0463576828	17.6470588235)
(1.1051701302	0.04825277	17.8823529412)
(1.1689425676	0.0510371347	18.1176470588)
(1.2563891211	0.0548551337	18.3529411765)
(1.3678514535	0.0597216843	18.5882352941)
(1.4991249407	0.0654532085	18.8235294118)
(1.6406042199	0.0716303272	19.0588235294)
(1.777781112	0.0776195997	19.2941176471)
(1.893379625	0.0826667398	19.5294117647)
(1.970820394	0.0860478768	19.7647058824)

(1.9980964432	0.0872387748	20)

(1.970820394	0.0860478768	20.2352941176)
(1.893379625	0.0826667398	20.4705882353)
(1.777781112	0.0776195997	20.7058823529)
(1.6406042199	0.0716303272	20.9411764706)
(1.4991249407	0.0654532085	21.1764705882)
(1.3678514535	0.0597216843	21.4117647059)
(1.2563891211	0.0548551337	21.6470588235)
(1.1689425676	0.0510371347	21.8823529412)
(1.1051701302	0.04825277	22.1176470588)
(1.0617654984	0.0463576828	22.3529411765)
(1.0341173804	0.0451505399	22.5882352941)
(1.0176014512	0.0444294389	22.8235294118)
(1.0083350989	0.0440248612	23.0588235294)
(1.003446431	0.0438114174	23.2941176471)
(1.0010190015	0.0437054335	23.5294117647)
(0.9998837406	0.0436558669	23.7647058824)
(0.9993833649	0.0436340201	24)
(0.9991754139	0.0436249407	24.2352941176)
(0.9990938933	0.0436213815	24.4705882353)

(0.9990482353	0.0436188235	24.7058823529)

        )

        spline 5 8
        (
                (0.9990482353	-0.0436188235	15.2941176471)
//(0.9990482353	-0.0436188235	15.2941176471)
(0.9990938933	-0.0436213815	15.5294117647)
(0.9991754139	-0.0436249407	15.7647058824)
(0.9993833649	-0.0436340201	16)
(0.9998837406	-0.0436558669	16.2352941176)
(1.0010190015	-0.0437054335	16.4705882353)
(1.003446431	-0.0438114174	16.7058823529)
(1.0083350989	-0.0440248612	16.9411764706)
(1.0176014512	-0.0444294389	17.1764705882)
(1.0341173804	-0.0451505399	17.4117647059)
(1.0617654984	-0.0463576828	17.6470588235)
(1.1051701302	-0.04825277	17.8823529412)
(1.1689425676	-0.0510371347	18.1176470588)
(1.2563891211	-0.0548551337	18.3529411765)
(1.3678514535	-0.0597216843	18.5882352941)
(1.4991249407	-0.0654532085	18.8235294118)
(1.6406042199	-0.0716303272	19.0588235294)
(1.777781112	-0.0776195997	19.2941176471)
(1.893379625	-0.0826667398	19.5294117647)
(1.970820394	-0.0860478768	19.7647058824)

(1.9980964432	-0.0872387748	20)

(1.970820394	-0.0860478768	20.2352941176)
(1.893379625	-0.0826667398	20.4705882353)
(1.777781112	-0.0776195997	20.7058823529)
(1.6406042199	-0.0716303272	20.9411764706)
(1.4991249407	-0.0654532085	21.1764705882)
(1.3678514535	-0.0597216843	21.4117647059)
(1.2563891211	-0.0548551337	21.6470588235)
(1.1689425676	-0.0510371347	21.8823529412)
(1.1051701302	-0.04825277	22.1176470588)
(1.0617654984	-0.0463576828	22.3529411765)
(1.0341173804	-0.0451505399	22.5882352941)
(1.0176014512	-0.0444294389	22.8235294118)
(1.0083350989	-0.0440248612	23.0588235294)
(1.003446431	-0.0438114174	23.2941176471)
(1.0010190015	-0.0437054335	23.5294117647)
(0.9998837406	-0.0436558669	23.7647058824)
(0.9993833649	-0.0436340201	24)
(0.9991754139	-0.0436249407	24.2352941176)
(0.9990938933	-0.0436213815	24.4705882353)

(0.9990482353	-0.0436188235	24.7058823529)

        )

);

boundary
(
    front
    {
        type wedge;
        faces
        (
            (0 1 2 3)
            (3 2 7 6)
            (6 7 10 9)
	
        );
    }

    back
    {
        type wedge;
        faces
        (
            (0 3 5 4) 
            (3 6 8 5)
            (6 9 11 8)
        );
    }

    wall
    {
        type wall;
        faces
        (
            (1 4 5 2)
            (2 5 8 7)
            (8 11 10 7)
        );
    }

    outlet
    {
        type patch;
        faces
        (
            (9 11 10 9)
        );
    }

    inlet
    {
        type patch;
        faces
        (
            (0 4 1 0)
        );
    }

    axis
    {
        type empty;
        faces
        (
            (0 3 3 0)
            (3 6 6 3)
            (6 9 9 6)
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
